ci4-api-flutter/app/Controllers/LoginController.php

    public function login()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $model = new MMember();
        $member = $model->where(['email' => $email])->first();

        if (!$member) {
            return $this->responseHasil(400, false, "Email tidak ditemukan");
        }

        if (!password_verify($password, $member['password'])) {
            return $this->responseHasil(400, false, "Password tidak valid");
        }

        $memberTokenModel = new MMemberToken();
        $auth_key = $this->randomString();
        $memberTokenModel->save([
            'member_id' => $member['id'],
            'auth_key' => $auth_key
        ]);
---
SELECT *
FROM `member`
WHERE `email` = 'daffa@gmail.com'
 LIMIT 1
INSERT INTO `member_token` (`member_id`, `auth_key`) VALUES ('1', 'ikQd4tYG9CC7f2LnpS9v2B0wr3rdVOMkUwJnetBUpm64auwSXGbEMGh3ukSgmFSbl6BGJkantiHRzwOBu9aEUCBIgqlEPdaHJWrT')