ci4-api-flutter/app/Controllers/RegistrasiController.php

INSERT INTO `member` (`nama`, `email`, `password`) VALUES ('abid', 'abid@gmail.com', '$2y$10$25q/lWmVbW5djV3jogc7Kequx2Lq.fIK1IDbb81agdQm9uoS6DB9S')
---
    public function registrasi()
    {
        $nama = $this->request->getVar('nama');
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // Validasi data input
        if (empty($nama) || empty($email) || empty($password)) {
            return $this->responseHasil(400, false, "Nama, Email, dan Password harus diisi");
        }

        // Hash password
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);

        // Persiapan data untuk disimpan
        $data = [
            'nama' => $nama,
            'email' => $email,
            'password' => $hashedPassword
        ];

        // Simpan data menggunakan model
        $model = new MMember();
        if ($model->save($data)) {